artillery/trajectories/commands/delete_trajectory.yml
config:
  target: 'https://lemonade.leersteun.lars-tst.school'
  phases:
    - duration: 1
      arrivalRate: 10
      name: "Trajectory delete commands"
  # Load CSV data
  payload:
    path: '../../data/tst-questions-mongo.csv'
    fields:
      - 'question_id'
    skipHeader: true
    delimiter: ','
  variables:
    access_token: "{{ $env.ACCESS_TOKEN }}"
    mongo_claims: "{{ $env.MONGO_CLAIMS }}"
  processor: '../../utils/response-logger.js'

scenarios:
  - name: "Delete trajectory from CSV"
    weight: 100
    flow:
      - post:
          url: '/api/zorglink/zorglink-trajectory/{{ question_id }}'
          headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
          json:
            _id: '{{ question_id }}'
            _corr: '{{ custom_uuid }}'
            _command: "delete"
            _type: "zorglink-trajectory"
          beforeRequest: 'generateUuid' 
          afterResponse: 'logResponse'
          expect:
            - statusCode: 
                - 200
                - 201
            - contentType: json